<?php
namespace AppBundle\DataFixtures\ORM;

use Doctrine\Common\Persistence\ObjectManager;
use Hautelook\AliceBundle\Alice\DataFixtureLoader;
use Nelmio\Alice\Fixtures;

class LoadData extends DataFixtureLoader
{
    public function load(ObjectManager $om)
    {
        Fixtures::load(__DIR__ . '/fixtures.yml', $om, array('providers' => array($this)));
    }

    public function performanceName()
    {
        $names = array(
            'Хто в домі господар?',
            'Кайдашева сім\'я',
            'Сад Гетсиманський',
            'Шельменко-денщик'
        );

        return $names[array_rand($names)];
    }

    public function performanceDescription()
    {
        $names = array(
            'За комедією «Фараони» Олексія Коломійця про реалії життя в невеликому містечку з його колгоспом, проблемами і прагненням до покращення та сподіванням на механізацію процесу господарювання. Музична вистава, де не зрозуміло в деякі моменти – чи жартують із вами зі сцени, чи абсолютно серйозно виголошують ідеологічні лозунги. Історія про те, як чоловіки з жінками помінялися своїми «професійними» обов’язками, зрозуміли усі «переваги» життя протилежної статі, виявилася лише сном головного героя Миколи Тарана (Юрій Берлінський). Сном, але не без моралі. Чоловіки зрозуміли, що потрібно берегти своїх жінок, адже домашні справи, виявляється, переробити не так то й легко. Обурює чоловіків у нових амплуа і те, що жінки перебрали на себе їхню місію гуляти до пізньої ночі та пити горілку',
            'Повість «Кайдашева сім\'я» написана нашим земляком Іваном Нечуєм-Левицьким понад 100 років тому. Але чи знайдуться і сьогодні байдужі до родинних пристрастей, що раз по раз вибухають у боротьбі за сімейне верховенство між свекрухою та невісткою? Та ще коли одна варта другої, замість сподіваного спочинку мати змушена всьому дати лад.',
            'Боже духів і всякої плоті, Ти смерть подолав і диявола знищив, і життя світові Твоєму дарував; Сам, Господи, упокой душі усопших рабів Твоїх, у місці світлім, у місці квітучім, у місці спокійнім, де нема ні хвороби, ні печалі, ні зітхання. Всяке гріхопадіння вчинене нами словом, або ділом, або помислом, як благий і чоловіколюбець Бог, прости, бо немає чоловіка, що жив би, а не згрішив; бо Ти один без гріха, правда Твоя – правда во віки, і слово Твоє - Істина. Амінь.',
            'О, добре б, братику, було, якби ми так говорили, як у книжках пишуть, а якби ще так і робили, так би й не було на світі нічого луччого'
        );

        return $names[array_rand($names)];
    }

    public function premiereDate()
    {
        $names = array(
            new \DateTime('2015-01-31 17:00'),
            new \DateTime('2015-01-29 18:30'),
            new \DateTime('2015-01-25 17:00'),
            new \DateTime('2015-01-18 17:00')
        );

        return $names[array_rand($names)];
    }

    public function roleName()
    {
        $names = array(
            'Стецько',
            'Фенна Степанівна',
            'Андрій Чумак',
            'Варя'
        );

        return $names[array_rand($names)];
    }

    public function roleDescription()
    {
        $names = array(
            'Стецько не дурний… Його батько каже, що просто, у нього, не всі вдома. Але Стецько впевнений, що до вечора вони позбираються. А ще, у його батька, є ГРОШІ!!! І ця обставина дає право Стецькові свататись до любої дівчини у Гончарівці. Але дивакуваті дівчата іншої думки… Вони мріють про якесь КОХАННЯ',
            'Жінка Кирила Петровича Шпака, поміщика. Мама Прісіньки. У заможного Шпака є красива донька, якій він знайшов, на його думку, достойного і відповідного нареченого. Та дівчина покохала іншого, на шлюб з яким Шпак не може погодитися. Не може, поки у справу не втручається виверткий денщик Шельменко',
            'Андрій Чумак, головний герой твору, піднімається на Голгофу власного життя, намагаючись зберегти свої принципи, погляди, переконання, пройти всі кола пекла радянської в’язниці й залишитися людиною',
            'Варвара Михайлівна - одна з головних героїнь у постановці «Вишневий сад», прийомна дочка поміщиці Раневської. Їй 24 роки і вона веде все господарство Раневських, виступаючи одночасно і прийомною дочкою, і економкою. За вдачею Варя дуже скромна і благочестива дівчина, сумлінно відноситься до своїх завдань. Мрія Варі - мати хоча б сто рублів і поїхати по святих місцях або піти у монашки'
        );

        return $names[array_rand($names)];
    }

    public function firstNameEmpl()
    {
        $names = array(
            'Наталія',
            'Юрій',
            'Марія',
            'Сергій'
        );

        return $names[array_rand($names)];
    }

    public function lastNameEmpl()
    {
        $names = array(
            'Вігран',
            'Проскурня',
            'Марущак',
            'Талан'
        );

        return $names[array_rand($names)];
    }

    public function positionName()
    {
        $names = array(
            'Заслужений артист України',
            'Заслужена артистка України',
            'Актор',
            'Актриса'
        );

        return $names[array_rand($names)];
    }

    protected function getFixtures()
    {
        return array(
            __DIR__ . '/fixtures.yml',
        );
    }
}
